cf_billing/InformationRegisters/энргСостояниеВыполненияОбязанностейГарантирующегоПоставщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеВыполненияОбязанностейГарантирующегоПоставщика</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбязанностиВыполнены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеВыполненияОбязанностейГарантирующегоПоставщика/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РеализацияИнтерефейса_ЗаполнениеСхемыЗапроса

// Заполняет состояние выполнения обязанностей гарантирующего поставщика.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура СостояниеВыполненияОбязанностейГарантирующегоПоставщика(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСостояниеВыполненияОбязанностейГарантирующегоПоставщика());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли; 
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, ЧастныйСектор, Строение, Помещение, ТочкаУчета";
		ПараметрыВиртуальнойТаблицы = ОператорВыбора.Источники[0].Источник.Параметры[1];
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ПараметрыВиртуальнойТаблицы, ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
КонецПроцедуры

// Заполняет точки с не выполненными обязанностями гарантирующего поставщика.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ТочкиСНеВыполненнымиОбязанностямиГарантирующегоПоставщика(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаТочкиСНеВыполненнымиОбязанностямиГарантирующегоПоставщика());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли; 
	
	Если ПараметрыОтбора.Свойство("ЕстьОтборПоКлючамПомещений") И ПараметрыОтбора.ЕстьОтборПоКлючамПомещений Тогда
		НовыйИсточник 			= ОператорВыбора.Источники.Добавить("ЗначенияКлючейПомещений", "энргКлючиПомещений");
		
		СоотвествиеУсловий	= Новый Соответствие;
		СоотвествиеУсловий.Вставить("Помещение", "Помещение");
		СоотвествиеУсловий.Вставить("Строение", "Строение");
		МассивУсловий		= Новый Массив;
		МассивУсловий.Добавить(Новый Структура("ТипУсловия,СоотвествиеУсловий","ТипУсловияРавно", СоотвествиеУсловий));
		
		энргФормированиеТекстовЗапроса.УстановитьИсточникЗапроса(ОператорВыбора.Источники[0], НовыйИсточник, ТипСоединенияСхемыЗапроса.Внутреннее, МассивУсловий);  
		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, ЧастныйСектор, Строение, Помещение, ТочкаУчета";
		ПараметрыВиртуальнойТаблицы = ОператорВыбора.Источники[0].Источник.Параметры[1];
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ПараметрыВиртуальнойТаблицы, ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
КонецПроцедуры

// Заполняет точки с не выполненными обязанностями гарантирующего поставщика коллекция периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаПериодов		-	Строка.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ТочкиСНеВыполненнымиОбязанностямиГарантирующегоПоставщикаКоллекцияПериодов(Схема, ПараметрыОтбора, ТаблицаПериодов, ТаблицаДляПомещения = "") Экспорт 
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаТочкиСНеВыполненнымиОбязанностямиГарантирующегоПоставщикаКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	//ОператорВыбора 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0].Источники[0].Источник.Запрос.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];	
	//Источник 						= ОператорВыбора.Источники[1].Источник;		
КонецПроцедуры

#Область ТекстыЗапросов

Функция ТекстЗапросаСостояниеВыполненияОбязанностейГарантирующегоПоставщика()
	
	Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСрезаДанных.ПериодНачисления КАК ПериодНачисленияРегистратора,
	|	ТаблицаСрезаДанных.Организация КАК Организация,
	|	ТаблицаСрезаДанных.Район КАК Район,
	|	ТаблицаСрезаДанных.ЧастныйСектор КАК ЧастныйСектор,
	|	ТаблицаСрезаДанных.Строение КАК Строение,
	|	ТаблицаСрезаДанных.Помещение КАК Помещение,
	|	ТаблицаСрезаДанных.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаСрезаДанных.ОбязанностиВыполнены КАК ОбязанностиВыполнены	
	|ИЗ
	|	РегистрСведений.энргСостояниеВыполненияОбязанностейГарантирующегоПоставщика.СрезПоследних КАК ТаблицаСрезаДанных";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаТочкиСНеВыполненнымиОбязанностямиГарантирующегоПоставщика()
	
	Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСрезаДанных.ПериодНачисления КАК ПериодНачисленияРегистратора,
	|	ТаблицаСрезаДанных.Организация КАК Организация,
	|	ТаблицаСрезаДанных.Район КАК Район,
	|	ТаблицаСрезаДанных.ЧастныйСектор КАК ЧастныйСектор,
	|	ТаблицаСрезаДанных.Строение КАК Строение,
	|	ТаблицаСрезаДанных.Помещение КАК Помещение,
	|	ТаблицаСрезаДанных.ТочкаУчета КАК ТочкаУчета
	|ИЗ
	|	РегистрСведений.энргСостояниеВыполненияОбязанностейГарантирующегоПоставщика.СрезПоследних КАК ТаблицаСрезаДанных
	|ГДЕ
	|	НЕ ТаблицаСрезаДанных.ОбязанностиВыполнены";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаТочкиСНеВыполненнымиОбязанностямиГарантирующегоПоставщикаКоллекцияПериодов()
	Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаСостояниеВыполненияОбязанностей.ПериодНачисления КАК ПериодНачисленияРегистратора,
	|	ТаблицаСостояниеВыполненияОбязанностей.Организация КАК Организация,
	|	ТаблицаСостояниеВыполненияОбязанностей.Район КАК Район,
	|	ТаблицаСостояниеВыполненияОбязанностей.ЧастныйСектор КАК ЧастныйСектор,
	|	ТаблицаСостояниеВыполненияОбязанностей.Строение КАК Строение,
	|	ТаблицаСостояниеВыполненияОбязанностей.Помещение КАК Помещение,
	|	ТаблицаСостояниеВыполненияОбязанностей.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаСостояниеВыполненияОбязанностей.ОбязанностиВыполнены КАК ОбязанностиВыполнены
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПериодов.ПериодНачисления КАК ПериодНачисления,
	|		ТаблицаСостояниеВыполненияОбязанностей.Организация КАК Организация,
	|		ТаблицаСостояниеВыполненияОбязанностей.Район КАК Район,
	|		ТаблицаСостояниеВыполненияОбязанностей.ЧастныйСектор КАК ЧастныйСектор,
	|		ТаблицаСостояниеВыполненияОбязанностей.Строение КАК Строение,
	|		ТаблицаСостояниеВыполненияОбязанностей.Помещение КАК Помещение,
	|		ТаблицаСостояниеВыполненияОбязанностей.ТочкаУчета КАК ТочкаУчета,
	|		МАКСИМУМ(ТаблицаСостояниеВыполненияОбязанностей.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.энргСостояниеВыполненияОбязанностейГарантирующегоПоставщика КАК ТаблицаСостояниеВыполненияОбязанностей
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|			ПО ТаблицаСостояниеВыполненияОбязанностей.Организация = ТаблицаПериодов.Организация
	|				И ТаблицаСостояниеВыполненияОбязанностей.Район = ТаблицаПериодов.Район
	|				И ТаблицаСостояниеВыполненияОбязанностей.Период < ТаблицаПериодов.ЗавершениеОП
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаПериодов.ПериодНачисления,
	|		ТаблицаСостояниеВыполненияОбязанностей.Организация,
	|		ТаблицаСостояниеВыполненияОбязанностей.Район,
	|		ТаблицаСостояниеВыполненияОбязанностей.ЧастныйСектор,
	|		ТаблицаСостояниеВыполненияОбязанностей.Строение,
	|		ТаблицаСостояниеВыполненияОбязанностей.Помещение,
	|		ТаблицаСостояниеВыполненияОбязанностей.ТочкаУчета) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргСостояниеВыполненияОбязанностейГарантирующегоПоставщика КАК ТаблицаСостояниеВыполненияОбязанностей
	|		ПО ВложенныйЗапрос.Период = ТаблицаСостояниеВыполненияОбязанностей.Период
	|			И ВложенныйЗапрос.Организация = ТаблицаСостояниеВыполненияОбязанностей.Организация
	|			И ВложенныйЗапрос.Район = ТаблицаСостояниеВыполненияОбязанностей.Район
	|			И ВложенныйЗапрос.ЧастныйСектор = ТаблицаСостояниеВыполненияОбязанностей.ЧастныйСектор
	|			И ВложенныйЗапрос.Строение = ТаблицаСостояниеВыполненияОбязанностей.Строение
	|			И ВложенныйЗапрос.Помещение = ТаблицаСостояниеВыполненияОбязанностей.Помещение
	|			И ВложенныйЗапрос.ТочкаУчета = ТаблицаСостояниеВыполненияОбязанностей.ТочкаУчета
	|			И (НЕ ТаблицаСостояниеВыполненияОбязанностей.ОбязанностиВыполнены)";
	
	Возврат Текст;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
